opening = ["[","{","("] #массив открывающихся скобок
ending = ["]","}",")"] #массив закрывающихся скобок
def balance(text): #функция, в которую передаём проверяемую строку
    stack = [] #стек, в который будем добавлять скобки в конец списка для проверки
    for i in text:
        if i in opening:
            stack.append(i) #если в передаваемой строке появляется открывающаяся скобка, то добавляем её в конец списка
        elif i in ending:
            position = ending.index(i) #если появляется закрывающаяся скобка, запоминаем значение из списка закрывающихся скобок
            if ((len(stack) > 0) and (opening[position] == stack[len(stack)-1])):
                stack.pop() #если длинна стека больше 0 и значение открытия равно значению последнего эл-та стека, очищаем последний эл-т стека
            else:
                return False
    if len(stack) != 0:
        return False #если стек не пустой, значит скобки невалидны
    if len(stack) == 0:
        return True #если стек пуст, то скобки валидны
text = input("Введите строку: ")
print (balance(text))